Tekla.Structures.DrawingInternal.DocumentManagerController.DrawingChangedEventArgs
Drawing changed event args.

Tekla.Structures.DrawingInternal.DocumentManagerController.DrawingChangedEventArgs.#ctor(System.Func{Tekla.Structures.Drawing.Drawing},System.Boolean,System.Int32)
Initializes a new instance of the Tekla.Structures.DrawingInternal.DocumentManagerController.DrawingChangedEventArgs class.
getNewDrawing: Function to get the new drawing.
oldDrawingIsNotNull: The old drawing is not null.
oldDrawingId: The old drawing id.

Tekla.Structures.DrawingInternal.DocumentManagerController.DrawingChangedEventArgs.GetNewDrawing
Gets the fuction to get the new drawing.

Tekla.Structures.DrawingInternal.DocumentManagerController.DrawingChangedEventArgs.OldDrawingIsNotNull
Gets a value indicating whether the old drawing is not null.

Tekla.Structures.DrawingInternal.DocumentManagerController.DrawingChangedEventArgs.OldDrawingId
Gets the old drawing ID.